class ItemList(object):
    item_dict = {
        0: "彩虹猫之刃",
        1: "狂星之怒",
        2: "泰拉悠悠球",
        3: "月亮传送门法杖",
        4: "七彩水晶法杖",
        5: "太空海豚机枪",
        6: "庆典MK2",
        7: "最终棱镜",
        8: "月耀",
        9: "彩虹猫矿车",
        10: "夜明矿",

        11: "星光",
        12: "夜光",
        13: "日暮",
        14: "万花筒",
        15: "女皇之翼",
        16: "星星吉他",
        17: "彩虹光标",

        18: "毒刺发射器",
        19: "疯狂飞斧",
        20: "太阳石",
        21: "石巨人之眼",
        22: "大地法杖",
        23: "高温射线枪",
        24: "石巨人之拳",
        25: "锯刃镐",

        26: "榴弹发射器",
        27: "维纳斯万能枪",
        28: "爆裂藤蔓",
        29: "吹叶机",
        30: "花之力",
        31: "胡蜂枪",
        32: "种子弯刀",
        33: "矮人法杖",
        34: "吉他斧",
        35: "刺钩",

        36: "泡泡枪",
        37: "利刃台风",
        38: "猪鲨链球",
        39: "海啸",
        40: "暴风雨法杖",
        41: "猪龙鱼之翼",

        42: "Aaron的套装",
        43: "Arkhalis的套装",
        44: "Cenx的套装",
        45: "Red的套装",
        46: "Crowno的套装",
        47: "D-Town的套装",
        48: "Jim的套装",
        49: "Lazure的套装",
        50: "Leinfors的套装",
        51: "Loki的套装",
        52: "Red的套装",
        53: "Skiphs的套装",
        54: "Will的套装",
        55: "Yoraiz0r的套装",
        56: "Grox The Great的套装",
        57: "FoodBarbarian的套装",
        58: "Safeman的套装",
        59: "Ghostar的套装",

        60: "护卫奖章",  # 30-49
        61: "双足翼龙之翼",  # 25%
        62: "空中祸害",
        63: "天龙之怒",
        64: "双足翼龙怒气",
        65: "飞龙",

        66: "闪耀史莱姆气球",  # 25-74
        67: "水晶刺客兜帽",
        68: "水晶刺客上衣",
        69: "水晶刺客裤",  # 三个中掉两个
        70: "刃杖",  # 33%
        71: "明胶女式鞍",  # 50%
        72: "失谐钩爪",  # 50%

        73: "皇家凝胶",
        74: "粘鞍",  # 50%
        75: "忍者兜帽",
        76: "忍者衣",
        77: "忍者裤",
        78: "史莱姆枪",  # 50%
        79: "史莱姆钩",  # 50%

        80: "克苏鲁之盾",
        81: "双筒望远镜",  # 1/30
        82: "魔矿",  # 30-90
        83: "邪箭",  # 20-50
        84: "腐化种子",  # 1-3

        85: "蠕虫围巾",
        86: "暗影鳞片",
        87: "吞噬怪骨头",  # 0.05

        88: "混乱之脑",
        89: "猩红矿",
        90: "组织样本",
        91: "骨头拨浪鼓",

        92: "蜂巢背包",
        93: "蜜蜂枪",
        94: "养蜂人",
        95: "蜂膝弓",
        96: "蜂窝",
        97: "花蜜",
        98: "涂蜜护目镜",
        99: "蜂巢魔棒",
        100: "蜜蜂帽",
        101: "蜜蜂衣",
        102: "蜜蜂裤",
        103: "蜜蜂手榴弹",
        104: "蜂蜡",

        105: "骨头手套",  # 100%
        106: "骷髅王之手",
        107: "骷髅头法书",

        108: "骸骨头盔",  # 100%
        109: "眼骨",  # 1/3
        110: "眼球伞",  # 1/3
        111: "收音机",  # 1/3
        112: "气喇叭",
        113: "天候棒",
        114: "眼球激光塔",
        115: "露西斧",

        116: "神锤",
        117: "战士徽章",
        118: "游侠徽章",
        119: "巫士徽章",
        120: "召唤师徽章",
        121: "毁灭刃",  # 四选一
        122: "发条式突击步枪",
        123: "激光步枪",
        124: "鞭炮",
        125: "恶魔之心",

        126: "骷髅王面具",
        127: "天界星盘",
        128: "传送枪",
        129: "重力球",
        130: "可疑触手",
        131: "翱翔证章",
        132: "闪亮石",
        133: "甲虫外壳",
        134: "孢子囊",
        135: "神庙钥匙",
        136: "幼苗",
        137: "虾松露",
        138: "挥发明胶",
        139: "神圣锭",
        140: "机械车体片",
        141: "力量之魂",
        142: "机械车轮片",
        143: "视域之魂",
        144: "机械电池片",
        145: "恐惧之魂",

        146: "战争桌",
        147: "战争桌旗",
        148: "龙蛋",
        149: "Gato蛋",
        150: "暗黑魔法师纪念章",
        151: "暗黑魔法师巨著",

        152: "学徒围巾",
        153: "侍卫护盾",
        154: "女猎人圆盾",
        155: "武僧腰带",
        156: "无限智慧巨著",
        157: "幽灵凤凰",
        158: "地狱烙印",
        159: "瞌睡章鱼",
        160: "恐怖关刀",
        161: "飞眼怪蛋",
        162: "食人魔纪念章",

        163: "钱币枪",
        164: "幸运币",
        165: "优惠卡",
        166: "海盗法杖",
        167: "金戒指",
        168: "荷兰人矿车",
        169: "短弯刀",
        170: "黑斑",
        171: "荷兰飞盗船纪念章",

        172: "阴森木",
        173: "阴森钩",
        174: "阴森嫩枝",
        175: "尖桩发射器",
        176: "尖桩",
        177: "诅咒树苗",
        178: "死灵卷轴",
        179: "哀木纪念章",
        180: "女巫扫帚",
        181: "魔法树枝",

        182: "无头骑士之剑",
        183: "蝙蝠权杖",
        184: "黑色仙尘",
        185: "蜘蛛卵",
        186: "乌鸦法杖",
        187: "玉米糖步枪",
        188: "玉米糖",
        189: "杰克南瓜灯发射器",
        190: "爆炸杰克南瓜灯",
        191: "暗黑收割",
        192: "南瓜王纪念章",
        193: "南瓜香薰蜡烛",

        194: "圣诞树剑",
        195: "圣诞钩",
        196: "剃刀松",
        197: "喜庆之翼",
        198: "常绿尖叫怪纪念章",
        199: "灌木星星",

        200: "精灵熔枪",
        201: "链式机枪",
        202: "圣诞坦克纪念章",
        203: "玩具坦克",

        204: "暴雪法杖",
        205: "雪人炮",
        206: "北极",
        207: "格林奇宝宝的恶作剧口哨",
        208: "驯鹿铃铛",
        209: "冰雪女王纪念章",
        210: "冰冻王冠",

        211: "外星霰弹枪",
        212: "外星法杖",
        213: "激光机枪",
        214: "电圈发射器",
        215: "波涌之刃",
        216: "宇宙车钥匙",
        217: "火星飞碟纪念章",
        218: "宇宙滑板",

        219: "食人魔棍棒"
    }

    dev_list = {
        42: "Aaron的套装",
        43: "Arkhalis的套装",
        44: "Cenx的套装",
        45: "Red的套装",
        46: "Crowno的套装",
        47: "D-Town的套装",
        48: "Jim的套装",
        49: "Lazure的套装",
        50: "Leinfors的套装",
        51: "Loki的套装",
        52: "Red的套装",
        53: "Skiphs的套装",
        54: "Will的套装",
        55: "Yoraiz0r的套装",
        56: "Grox The Great的套装",
        57: "FoodBarbarian的套装",
        58: "Safeman的套装",
        59: "Ghostar的套装",
    }

    all_names = list(item_dict.values())
    counts = [0] * len(all_names)

    links = {
        0: "https://terraria.wiki.gg/wiki/Meowmere",
        1: "https://terraria.wiki.gg/wiki/Star_Wrath",
        2: "https://terraria.wiki.gg/wiki/Terrarian",
        3: "https://terraria.wiki.gg/wiki/Lunar_Portal_Staff",
        4: "https://terraria.wiki.gg/wiki/Rainbow_Crystal_Staff",
        5: "https://terraria.wiki.gg/wiki/S.D.M.G.",
        6: "https://terraria.wiki.gg/wiki/Celebration_Mk2",
        7: "https://terraria.wiki.gg/wiki/Last_Prism",
        8: "https://terraria.wiki.gg/wiki/Lunar_Flare",
        9: "https://terraria.wiki.gg/wiki/Meowmere_Minecart",
        10: "https://terraria.wiki.gg/wiki/Luminite",

        11: "星光",
        12: "夜光",
        13: "日暮",
        14: "万花筒",
        15: "女皇之翼",
        16: "星星吉他",
        17: "彩虹光标",

        18: "毒刺发射器",
        19: "疯狂飞斧",
        20: "太阳石",
        21: "石巨人之眼",
        22: "大地法杖",
        23: "高温射线枪",
        24: "石巨人之拳",
        25: "锯刃镐",

        26: "榴弹发射器",
        27: "维纳斯万能枪",
        28: "爆裂藤蔓",
        29: "吹叶机",
        30: "花之力",
        31: "胡蜂枪",
        32: "种子弯刀",
        33: "矮人法杖",
        34: "吉他斧",
        35: "刺钩",

        36: "泡泡枪",
        37: "利刃台风",
        38: "猪鲨链球",
        39: "海啸",
        40: "暴风雨法杖",
        41: "猪龙鱼之翼",

        42: "Aaron的套装",
        43: "Arkhalis的套装",
        44: "Cenx的套装",
        45: "Red的套装",
        46: "Crowno的套装",
        47: "D-Town的套装",
        48: "Jim的套装",
        49: "Lazure的套装",
        50: "Leinfors的套装",
        51: "Loki的套装",
        52: "Red的套装",
        53: "Skiphs的套装",
        54: "Will的套装",
        55: "Yoraiz0r的套装",
        56: "Grox The Great的套装",
        57: "FoodBarbarian的套装",
        58: "Safeman的套装",
        59: "Ghostar的套装",

        60: "护卫奖章",  # 30-49
        61: "双足翼龙之翼",  # 25%
        62: "空中祸害",
        63: "天龙之怒",
        64: "双足翼龙怒气",
        65: "飞龙",

        66: "闪耀史莱姆气球",  # 25-74
        67: "水晶刺客兜帽",
        68: "水晶刺客上衣",
        69: "水晶刺客裤",  # 三个中掉两个
        70: "刃杖",  # 33%
        71: "明胶女式鞍",  # 50%
        72: "失谐钩爪",  # 50%

        73: "皇家凝胶",
        74: "粘鞍",  # 50%
        75: "忍者兜帽",
        76: "忍者衣",
        77: "忍者裤",
        78: "史莱姆枪",  # 50%
        79: "史莱姆钩",  # 50%

        80: "克苏鲁之盾",
        81: "双筒望远镜",  # 1/30
        82: "魔矿",  # 30-90
        83: "邪箭",  # 20-50
        84: "腐化种子",  # 1-3

        85: "蠕虫围巾",
        86: "暗影鳞片",
        87: "吞噬怪骨头",  # 0.05

        88: "混乱之脑",
        89: "猩红矿",
        90: "组织样本",
        91: "骨头拨浪鼓",

        92: "蜂巢背包",
        93: "蜜蜂枪",
        94: "养蜂人",
        95: "蜂膝弓",
        96: "蜂窝",
        97: "花蜜",
        98: "涂蜜护目镜",
        99: "蜂巢魔棒",
        100: "蜜蜂帽",
        101: "蜜蜂衣",
        102: "蜜蜂裤",
        103: "蜜蜂手榴弹",
        104: "蜂蜡",

        105: "骨头手套",  # 100%
        106: "骷髅王之手",
        107: "骷髅头法书",

        108: "骸骨头盔",  # 100%
        109: "眼骨",  # 1/3
        110: "眼球伞",  # 1/3
        111: "收音机",  # 1/3
        112: "气喇叭",
        113: "天候棒",
        114: "眼球激光塔",
        115: "露西斧",

        116: "神锤",
        117: "战士徽章",
        118: "游侠徽章",
        119: "巫士徽章",
        120: "召唤师徽章",
        121: "毁灭刃",  # 四选一
        122: "发条式突击步枪",
        123: "激光步枪",
        124: "鞭炮",
        125: "恶魔之心",

        126: "骷髅王面具",
        127: "天界星盘",
        128: "传送枪",
        129: "重力球",
        130: "可疑触手",
        131: "翱翔证章",
        132: "闪亮石",
        133: "甲虫外壳",
        134: "孢子囊",
        135: "神庙钥匙",
        136: "幼苗",
        137: "虾松露",
        138: "挥发明胶",
        139: "神圣锭",
        140: "机械车体片",
        141: "力量之魂",
        142: "机械车轮片",
        143: "视域之魂",
        144: "机械电池片",
        145: "恐惧之魂",

        146: "战争桌",
        147: "战争桌旗",
        148: "龙蛋",
        149: "Gato蛋",
        150: "暗黑魔法师纪念章",
        151: "暗黑魔法师巨著",

        152: "学徒围巾",
        153: "侍卫护盾",
        154: "女猎人圆盾",
        155: "武僧腰带",
        156: "无限智慧巨著",
        157: "幽灵凤凰",
        158: "地狱烙印",
        159: "瞌睡章鱼",
        160: "恐怖关刀",
        161: "飞眼怪蛋",
        162: "食人魔纪念章",

        163: "钱币枪",
        164: "幸运币",
        165: "优惠卡",
        166: "海盗法杖",
        167: "金戒指",
        168: "荷兰人矿车",
        169: "短弯刀",
        170: "黑斑",
        171: "荷兰飞盗船纪念章",

        172: "阴森木",
        173: "阴森钩",
        174: "阴森嫩枝",
        175: "尖桩发射器",
        176: "尖桩",
        177: "诅咒树苗",
        178: "死灵卷轴",
        179: "哀木纪念章",
        180: "女巫扫帚",
        181: "魔法树枝",

        182: "无头骑士之剑",
        183: "蝙蝠权杖",
        184: "黑色仙尘",
        185: "蜘蛛卵",
        186: "乌鸦法杖",
        187: "玉米糖步枪",
        188: "玉米糖",
        189: "杰克南瓜灯发射器",
        190: "爆炸杰克南瓜灯",
        191: "暗黑收割",
        192: "南瓜王纪念章",
        193: "南瓜香薰蜡烛",

        194: "圣诞树剑",
        195: "圣诞钩",
        196: "剃刀松",
        197: "喜庆之翼",
        198: "常绿尖叫怪纪念章",
        199: "灌木星星",

        200: "精灵熔枪",
        201: "链式机枪",
        202: "圣诞坦克纪念章",
        203: "玩具坦克",

        204: "暴雪法杖",
        205: "雪人炮",
        206: "北极",
        207: "格林奇宝宝的恶作剧口哨",
        208: "驯鹿铃铛",
        209: "冰雪女王纪念章",
        210: "冰冻王冠",

        211: "外星霰弹枪",
        212: "外星法杖",
        213: "激光机枪",
        214: "电圈发射器",
        215: "波涌之刃",
        216: "宇宙车钥匙",
        217: "火星飞碟纪念章",
        218: "宇宙滑板",

        219: "食人魔棍棒"

    }
